---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotX
source: html/5ebed072-13d3-ee0f-807e-a2f2ea45fa47.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotX Property

"X Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryRestraintRotX { get; }
```